// オセロ
public class Osero {
    // 盤面の表示
    // ・１行目に, ８こマスを表示させる
    // ・８マスを8行表示させる
    // ・ゲームの初期盤面をつくる
    //   初期盤面は真ん中に黒と白の駒を置いた状態
    
    // 駒を置く
    // ・駒が置けるかどうか判定する
    // ・駒を置く場所をキーボードから入力する(xとyの値)
    // ・駒が黒か白か判定する
    // ・駒を置く
    // ・駒の表示

    // 駒をひっくり返す
    // ・駒を置いたところを出発点にする
    // ・上下左右，斜めの8方向から1つ方向を選ぶ
    // ・選んだ方向に1マスずつ移動してマスの状態を調べる
    //  調べる状態
    //   ・相手の駒があるなら，次のマスに移動する
    //   ・移動したマスに自分の駒があったら，出発点と現在のマスまでの相手の駒を自分の駒に変える
    //     → 処理を終了する
    //   ・空きマスか壁だった場合は何もせず処理を終了する
    // ・調べる処理を全8方向で行う

    // 駒が置けるかどうか判定する
}
